Catalogs/фин_НастройкиОбменаТабличнымиДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_НастройкиОбменаТабличнымиДокументами</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДляЗагрузкиФактическихИПрогнозныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ДополнительныеРазрезыОтчетов</v8:Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
						<v8:Type>cfg:EnumRef.фин_РесурсыДанныхБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетсяРазрезВКолонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяКолонка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяСтрока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаЗаголовкаФормы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаШапкиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РисоватьСеткуТаблицы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоУмолчаниюДляВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПоУмолчаниюДляЗагрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ВариантыСинхронизацииСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТрансляцияРазрезов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ДополнительныеРазрезыОтчетов</v8:Type>
								<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
								<v8:Type>cfg:EnumRef.фин_РесурсыДанныхБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итоги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоВИтогах</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_ВариантыСинхронизацииСправочников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиВКолонках</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Разрез</Name>
							<Type>
								<v8:Type>cfg:EnumRef.фин_РесурсыДанныхБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/фин_НастройкаДополнительныхРазрезовБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_НастройкаДополнительныхРазрезовБюджетирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.фин_ВидыСубконтоБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляКомплектаБюджетов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_ФактическиеПоказателиБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/фин_ФактическиеПоказателиБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ФактическиеПоказателиБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФинансовыйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправленческоеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрез10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПериодПланирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_РесурсыДанныхБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_РесурсыДанныхБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаУпр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютнаяСумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаСценария</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаУпр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютнаяЦена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦенаСценария</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ДополнительныеРазрезыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ДополнительныеРазрезыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПричинаКорректировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпособКорректировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаОтклонения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидОперации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтролирующийСценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субконто1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субконто2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субконто3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субконто4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субконто5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорСубконто1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорСубконто2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорСубконто3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорСубконто4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорСубконто5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютаКор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяБюджета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПланирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументРассмотрения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидВлиянияНаФинансовыйРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидСтруктурногоОтклонения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтруктурноеОтклонение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидОтклонения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаОтклоненияФактическихДанных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/фин_ВариантыСинхронизацииСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_ВариантыСинхронизацииСправочников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоКоду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНаименованию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_НастройкиОбменаТабличнымиДокументами/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТрансляцияРазрезовРазрезНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ДанныеВыбора = СписокРазрезов;
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВКолонкахРазрезНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ДанныеВыбора = СписокПоказателей;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтотОбъект);
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.НастроитьПредставлениеРазрезов(ЭтотОбъект,,"ТрансляцияРазрезов",Ложь,,"Разрез");
	фин_РаботаСДополнительнымиРазрезамиБюджетирования.НастроитьПредставлениеРазрезов(ЭтотОбъект,,"Объект",Ложь,Истина,"Колонка");
	ЗаполнитьСпискиВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ДляЗагрузкиФактическихИПрогнозныхДанныхПриИзменении(Элемент)
	Если Объект.ДляЗагрузкиФактическихИПрогнозныхДанных Тогда
		Объект.Бюджет=ПредопределенноеЗначение("Справочник.фин_Бюджеты.ПустаяСсылка");
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьСпискиВыбора(Истина);
КонецПроцедуры

&НаКлиенте
Процедура БюджетПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьСпискиВыбора(Истина);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УправлениеФормой(Форма)
	Элементы = Форма.Элементы;
	Элементы.Бюджет.Видимость = НЕ Форма.Объект.ДляЗагрузкиФактическихИПрогнозныхДанных;	
КонецФункции

&НаСервере
Функция ЗаполнитьСпискиВыбора(Перезаполнять = Ложь)
	СписокПоказателей.Очистить();
	СписокРазрезов.Очистить();
	
	СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.ПериодПланирования);
	СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Валюта);
	
	Если Объект.ДляЗагрузкиФактическихИПрогнозныхДанных Тогда
		СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.ФинансовыйПоказатель);
		СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Контрагент);
		СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Проект);
		СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.Номенклатура);
		СписокРазрезов.Добавить(Перечисления.фин_ФактическиеПоказателиБюджетирования.УправленческоеПодразделение);
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	фин_НастройкаДополнительныхРазрезовБюджетирования.Измерение
			|ИЗ
			|	РегистрСведений.фин_НастройкаДополнительныхРазрезовБюджетирования КАК фин_НастройкаДополнительныхРазрезовБюджетирования";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокРазрезов.Добавить(ВыборкаДетальныеЗаписи.Измерение, фин_ОбщегоНазначенияВызовСервераПовтИсп.ПредставлениеРазреза(ВыборкаДетальныеЗаписи.Измерение));
		КонецЦикла;
		
		Если Объект.ИмеетсяРазрезВКолонке Тогда
			СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.Количество);
			СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяСумма);
			СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.СуммаУпр);
		Иначе
			СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.Количество);
			СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяСумма);
			СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.СуммаУпр);
		КонецЕсли;
		
	Иначе
		СписокРазрезов.Добавить(Перечисления.фин_ДополнительныеРазрезыОтчетов.СтатьяБюджета);
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",Объект.Бюджет);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	фин_БюджетыРазрезыУчета.Измерение
			|ИЗ
			|	Справочник.фин_Бюджеты.РазрезыУчета КАК фин_БюджетыРазрезыУчета
			|ГДЕ
			|	фин_БюджетыРазрезыУчета.Ссылка = &Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокРазрезов.Добавить(ВыборкаДетальныеЗаписи.Измерение, фин_ОбщегоНазначенияВызовСервераПовтИсп.ПредставлениеРазреза(ВыборкаДетальныеЗаписи.Измерение));
		КонецЦикла;
		Если Объект.ИмеетсяРазрезВКолонке Тогда
			Если Объект.Бюджет.УчетПоКоличеству Тогда
				СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.Количество);
			КонецЕсли;
			Если Объект.Бюджет.УчетПоСумме Тогда
				СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяСумма);
				СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.СуммаУпр);
				Если Объект.Бюджет.УчетПоКоличеству Тогда
					СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяЦена);
					СписокПоказателей.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ЦенаУпр);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Объект.Бюджет.УчетПоКоличеству Тогда
				СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.Количество);
			КонецЕсли;
			Если Объект.Бюджет.УчетПоСумме Тогда
				СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяСумма);
				СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.СуммаУпр);
				Если Объект.Бюджет.УчетПоКоличеству Тогда
					СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ВалютнаяЦена);
					СписокРазрезов.Добавить(Перечисления.фин_РесурсыДанныхБюджетирования.ЦенаУпр);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Перезаполнять Тогда
		СтрокиУдалить = Новый Массив;
		Для Каждого Строка Из Объект.ТрансляцияРазрезов Цикл
			Если СписокРазрезов.НайтиПоЗначению(Строка.Разрез)=Неопределено Тогда
				СтрокиУдалить.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка Из СтрокиУдалить Цикл
			Объект.ТрансляцияРазрезов.Удалить(Строка);
		КонецЦикла;
		Для Каждого ЭлементРазрез Из СписокРазрезов Цикл
			Если Объект.ТрансляцияРазрезов.НайтиСтроки(Новый структура("Разрез",ЭлементРазрез.Значение)).Количество()=0 Тогда
				НС = Объект.ТрансляцияРазрезов.Добавить();
				НС.Разрез = ЭлементРазрез.Значение;
				НС.Данные = ?(ЭлементРазрез.Значение=Перечисления.фин_ФактическиеПоказателиБюджетирования.ПериодПланирования ИЛИ ТипЗнч(ЭлементРазрез.Значение)=Тип("ПеречислениеСсылка.фин_РесурсыДанныхБюджетирования"),Перечисления.фин_ВариантыСинхронизацииСправочников.ПустаяСсылка(),Перечисления.фин_ВариантыСинхронизацииСправочников.ПоНаименованию);
				НС.ШиринаПоУмолчанию = ?(ТипЗнч(НС.Разрез)=Тип("ПеречислениеСсылка.фин_РесурсыДанныхБюджетирования"),8,?(НС.Разрез=ПредопределенноеЗначение("Перечисление.фин_ФактическиеПоказателиБюджетирования.ПериодПланирования"),10,?(НС.Разрез=ПредопределенноеЗначение("Перечисление.фин_ФактическиеПоказателиБюджетирования.Валюта"),4,15)));
				НС.Заголовок = фин_ОбщегоНазначенияВызовСервераПовтИсп.ПредставлениеРазреза(НС.Разрез);
			КонецЕсли;
		КонецЦикла;
		СтрокиУдалить = Новый Массив;
		Для Каждого Строка Из Объект.ПоказателиВКолонках Цикл
			Если СписокПоказателей.НайтиПоЗначению(Строка.Разрез)=Неопределено Тогда
				СтрокиУдалить.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Строка Из СтрокиУдалить Цикл
			Объект.ПоказателиВКолонках.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТрансляцияРазрезовРазрезПриИзменении(Элемент)
	НС = Элементы.ТрансляцияРазрезов.ТекущиеДанные;
	НС.Данные = ?(НС.Разрез=ПредопределенноеЗначение("Перечисление.фин_ФактическиеПоказателиБюджетирования.ПериодПланирования") ИЛИ ТипЗнч(НС.Разрез)=Тип("ПеречислениеСсылка.фин_РесурсыДанныхБюджетирования"),ПредопределенноеЗначение("Перечисление.фин_ВариантыСинхронизацииСправочников.ПустаяСсылка"),ПредопределенноеЗначение("Перечисление.фин_ВариантыСинхронизацииСправочников.ПоНаименованию"));
	НС.ШиринаПоУмолчанию = ?(ТипЗнч(НС.Разрез)=Тип("ПеречислениеСсылка.фин_РесурсыДанныхБюджетирования"),8,?(НС.Разрез=ПредопределенноеЗначение("Перечисление.фин_ФактическиеПоказателиБюджетирования.ПериодПланирования"),10,?(НС.Разрез=ПредопределенноеЗначение("Перечисление.фин_ФактическиеПоказателиБюджетирования.Валюта"),4,15)));
	НС.Заголовок = фин_ОбщегоНазначенияВызовСервераПовтИсп.ПредставлениеРазреза(НС.Разрез);
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВКолонкахПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ПоказателиВКолонках.ТекущиеДанные.ШиринаПоУмолчанию = 12;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТрансляцияРазрезовИтогиПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТрансляцияРазрезов.ТекущиеДанные;
	Если ТекущиеДанные.Итоги = Ложь Тогда
		ТекущиеДанные.ТолькоВИтогах = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИмеетсяРазрезВКолонкеПриИзменении(Элемент)
	ЗаполнитьСпискиВыбора(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВКолонкахРазрезПриИзменении(Элемент)
	НС = Элементы.ПоказателиВКолонках.ТекущиеДанные;
	НС.Заголовок = фин_ОбщегоНазначенияВызовСервераПовтИсп.ПредставлениеРазреза(НС.Разрез);
КонецПроцедуры
